{"type":"data","nodes":[null,{"type":"data","data":[{"posts":1,"microblogs":50},[2,7,12,16,22,27,33,39,45],{"title":3,"slug":4,"date":5,"preview":6},"Go fast!","fast","2024-01-01","A big lament of mine while I prepare for interviews is that it requires you to do things fast, usually faster than is required in the actual...",{"title":8,"slug":9,"date":10,"preview":11},"Consistent Hashing","consistent-hashing","2023-10-26","Recently I've been reading about the Chord distributed hash table network for a class. The goal of Chord is to map any key (e.g., a file nam...",{"title":13,"slug":14,"date":10,"preview":15},"Rendevous Hashing","rendevous-hashing","This is a follow up to my post on Consistent Hashing -- see that first\nConsistent hashing is a technique used for distributed hash tables th...",{"title":17,"slug":18,"date":19,"tags":20,"preview":21},"Python Coroutines!?!?","py-generator-couroutines","2023-06-11","async,asyncio,python,coroutine,generator","Python supports generators which allow you to .send() and recieve (via next(...)) values. They are kind of like channels since they don't bl...",{"title":23,"slug":24,"date":25,"preview":26},"Lessons from Product Managing","PMing","2023-06-01","When I started as a product manager at Roblox, I didn't really know what PMing entailed. After doing it, I can say that I still don't totall...",{"title":28,"slug":29,"date":30,"tags":31,"preview":32},"Einsum","einsum","2022-03-14","math","The basic idea for einstein notation is to drop the ∑\\sum∑ from summations in some cases (reducing notational complexity). For instance, you...",{"title":34,"slug":35,"date":36,"tags":37,"preview":38},"Entropy","entropy","2021-12-28","Information Theory","Inspired by this video on compression, I wanted to understand what carrying information actually means, from a few interesting examples rela...",{"title":40,"slug":41,"date":42,"tags":43,"preview":44},"Try again with sudo: _sudo","_sudo","2021-11-11","sudo, su, bash, sh, shell","Sometimes you want to run without sudo if you can... and run with sudo if you can't.\n_sudo.sh\n$@ || sudo $@\n...",{"title":46,"slug":47,"date":42,"tags":48,"preview":49},"Roku & Competition","competition-focus","Competition, Focus","Roku feels like a business being cannabalized by competitors with deeper pockets and tall vertical integration. For example, Amazon or Apple...",[51,56,60,64,68,72,76,80],{"title":52,"slug":53,"date":54,"content":55},"Cool software details in the Apple Music app","cool-software-details-in-the-apple-music-app-7e78f6e9c3666115","2026-01-26","\nCool software details in the Apple Music app\n- Apple Music radio shows change the cover art & artist as you listen\n- the playlists you save to your library update, including the ones that change weakly (I’m not sure if this is positive)\n- Apple animated album covers",{"title":57,"slug":58,"date":54,"content":59},"Corollary: pushing yourself is as kind of selective","corollary-pushing-yourself-is-as-kind-of-selective-4ba70216c64e836a","\nCorollary: pushing yourself is as kind of selective activity, you shouldn't really make everything super stressful",{"title":61,"slug":62,"date":54,"content":63},"It's possible to do things slowly and still","its-possible-to-do-things-slowly-and-still-73f45c5be20b9e63","\nIt's possible to do things slowly and still yield results, given they are the right things. Speed has become kind of an aesthetic thing in twitter technology culture\n\nMaybe the underlying assumption is that you wish to gain wealth as fast as possible, but there are definitely some things that take longer than a few months",{"title":65,"slug":66,"date":54,"content":67},"Listening to “Human Resources” by Dan Carlin, about","listening-to-human-resources-by-dan-carlin-about-e836f786366eb58d","\nListening to “Human Resources” by Dan Carlin, about slavery.\n\nOne is struck how much people were able to shape their opinions to their monetary incentives (eg, revolutionary France controlling Saint-Domingue, now Haiti)\n\nIt’s worth listening too because we are under informed about slavery, since it is avoided in media besides to make a current political point\n\nhttps://podcasts.apple.com/us/podcast/dan-carlins-hardcore-history/id173001861?i=1000553133741",{"title":69,"slug":70,"date":54,"content":71},"Relax for the same results - https://sive.rs/relax The","relax-for-the-same-results---httpssiversrelax-the-bb404b8942deebb1","\nRelax for the same results - https://sive.rs/relax\n\nThe idea is that you can the same results by not being super intense about everything.\n\nI think part of the idea is that you don't bind up your ego with thing thing you do when you don't treat it as do or die",{"title":73,"slug":74,"date":54,"content":75},"Small accordance in the alarms section on iOS.","small-accordance-in-the-alarms-section-on-ios-ec3bdca430a928e7","\nSmall accordance in the alarms section on iOS. When you modify an alarm it is also turned on. My engineer brain would say those are 2 separate things, but you only edit an alarm to set it. Good design doesn’t fall prey to my engineer brain.",{"title":77,"slug":78,"date":54,"content":79},"We are always like fish - the water","we-are-always-like-fish---the-water-f602d5d3dee7253b","\nWe are always like fish - the water we are in imposes optimization criteria and constraints we can't detect.\n\nFor instance, in startups, maybe one implicit criteria is getting wealth or revenue as fast as possible. This is good signal, but it may not actually be algined the goal we set for ourself (e.g., to build a particular kind of thing we wish to see in the world etc)",{"title":81,"slug":82,"date":54,"content":83},"\"You tell me whar a man gits his","you-tell-me-whar-a-man-gits-his-6c5b7634216fa40b","\n\"You tell me whar a man gits his corn pone, en I'll tell you what his 'pinions is.\"\n\nPart of this means our incentives shape our constraints. (there is more too it - Twain also says all opinions originate in this way. See: [https://paulgraham.com/cornpone.html](https://paulgraham.com/cornpone.html)\nfor a more complete excerpt)"],"uses":{}}]}
