{"pageProps":{"post":{"title":"Lessons from Product Managing","date":"2023-06-01","slug":"PMing","content":"<p>When I started as a product manager at Roblox, I didn't <em>really</em> know what PMing entailed. After doing it, I can say that I still don't totally know. Every PM seems to do it differently.</p>\n<p>There are some general trends, though. All the good PMs seem to be constantly thinking about the following things:</p>\n<ol>\n<li><em>The Customer</em> - There's a trap of using the metrics you measure to replace the customer. Adoption and retention don't tell you how the customer gets value from the product. It happens so gradually, though, that you don't realize that you've stopped thinking about the customer. And this is the most obvious part of your job as a PM! So it's important not to forget about the customer.</li>\n<li><em>Getting Stuff Done</em> - A good PM is effective not when they issue product directives from on high, but when they work really closely with engineers, designers, and data scientists to fill in the gaps left by the experts. That might mean making the first version of the design to reduce the load on your designer, or filling out paperwork for your engineers. The basic function of the PM is to reduce the mental load to allow builders to build.</li>\n<li><em>Simplify</em> - There are two parts: <strong>strong opinions held loosely</strong> and <strong>clear communication</strong>. Strong opinions held loosely, with justification, allow your team to push back on you and converge sooner. Clear, simple communication uses bullet points to make it obvious who needs to work on what and where the open questions lie. Many PMs don't dive deep into technical details because it impedes this function.</li>\n<li><em>Push, but not too hard</em> - The PMs I've seen asks lots of <em>why</em> questions. But they never push too hard on any one thing or undermine the more technical members of their team -- instead, they try to find a way to deliver value to customers around technical constraints.</li>\n<li><em>Constantly Communicate</em> - This is the advice I think is most applicable to a start-up. Having founders who constantly communicate, even around seemingly tiny milestones keeps the entire team grounded in the product and generates forward progress.</li>\n<li><em>Seek Contradiction</em> - this is hard to stomach when you near a deadline, but an incredible way to discover your underlying assumptions. Talk to other PMs, engineers, marketing people, privacy and safety people even (especially!) if you don't like what they will have to say.</li>\n<li><em>Global Tradeoffs</em> - Another trap in PMing is optimizing for your own product's success at the expense of everything else. Great PMs \"take the long view\" and optimize for a great user experience. Sometimes this means forgoing the low-hanging fruit for a better customer experience.</li>\n</ol>"},"morePosts":[{"title":"Go fast!","slug":"fast","date":"2024-01-01"},{"title":"Consistent Hashing","slug":"consistent-hashing","date":"2023-10-26"},{"title":"Rendevous Hashing","slug":"rendevous-hashing","date":"2023-10-26"},{"title":"Python Coroutines!?!?","slug":"py-generator-couroutines","date":"2023-06-11"},{"title":"Lessons from Product Managing","slug":"PMing","date":"2023-06-01"},{"title":"Einsum","slug":"einsum","date":"2022-03-14"},{"title":"Entropy","slug":"entropy","date":"2021-12-28"},{"title":"Try again with sudo: _sudo","slug":"_sudo","date":"2021-11-11"},{"title":"Roku & Competition","slug":"competition-focus","date":"2021-11-11"}]},"__N_SSG":true}